
  ### Terraform Plan

  detect infra code changes. please check terraform plan result.

  #### result `success`

  <details><summary>Show Plan</summary>

  ```

  Acquiring state lock. This may take a few moments...
[0m[1mdata.http.github_actions_openid_configuration: Reading...[0m[0m
[0m[1mdata.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration][0m
[0m[1mdata.tls_certificate.github_actions: Reading...[0m[0m
[0m[1maws_dynamodb_table.tfstate: Refreshing state... [id=static-site-terraform-lock-dev][0m
[0m[1maws_s3_bucket.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev][0m
[0m[1mdata.tls_certificate.github_actions: Read complete after 1s [id=42213ff4be793356631c8e7788749fa7d39a9d85][0m
[0m[1maws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::***:oidc-provider/token.actions.githubusercontent.com][0m
[0m[1mdata.aws_iam_policy_document.assume_role_for_any_branches: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role_for_any_branches: Read complete after 0s [id=1528356676][0m
[0m[1maws_iam_role.oidc_readonly: Refreshing state... [id=oidc-readonly-role][0m
[0m[1maws_iam_role_policy_attachment.readonly_for_terraform: Refreshing state... [id=oidc-readonly-role-20240108152622657800000002][0m
[0m[1mdata.aws_iam_policy_document.write_to_tf_lock: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.write_to_tf_lock: Read complete after 0s [id=1275146936][0m
[0m[1maws_iam_policy.write_to_tf_lock: Refreshing state... [id=arn:aws:iam::***:policy/allow-write-to-tf-lock][0m
[0m[1maws_iam_role_policy_attachment.write_to_tf_lock: Refreshing state... [id=oidc-readonly-role-20240108152622642300000001][0m
[0m[1maws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev][0m
[0m[1maws_s3_bucket_versioning.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev][0m
[0m[1maws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev][0m
[0m[1maws_s3_bucket_lifecycle_configuration.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_iam_policy.write_to_tf_lock[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_iam_policy" "write_to_tf_lock" {
      [33m~[0m[0m arn         = "arn:aws:iam::***:policy/allow-write-to-tf-lock" -> (known after apply)
      [33m~[0m[0m id          = "arn:aws:iam::***:policy/allow-write-to-tf-lock" -> (known after apply)
      [33m~[0m[0m name        = "allow-write-to-tf-lock" [33m->[0m[0m "allow-write-to-tf-lock-hoge" [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix = (known after apply)
      [33m~[0m[0m policy_id   = "ANPAWZXE67JINLFCOVNB5" -> (known after apply)
      [31m-[0m[0m tags        = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all    = {} -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_role_policy_attachment.write_to_tf_lock[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_iam_role_policy_attachment" "write_to_tf_lock" {
      [33m~[0m[0m id         = "oidc-readonly-role-20240108152622642300000001" -> (known after apply)
      [33m~[0m[0m policy_arn = "arn:aws:iam::***:policy/allow-write-to-tf-lock" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
